[
  "[File: src/errors.rs] [TryFromInt] [Platform-Dependent Behavior - Low] Since TryFromIntError can occur due to platform differences in integer sizes (32-bit vs 64-bit), does the protocol properly handle these errors in a platform-independent way, or could different platforms have different error behavior that breaks cross-platform compatibility?",
  "[File: src/errors.rs] [All Enums] [Error Serialization Size - Low] For serializable errors containing large Vec structures, are there any size limits enforced during serialization to prevent bandwidth exhaustion when transmitting error messages over the network?",
  "[File: src/errors.rs] [AggregatorError::BadPolyCommitments] [Memory Safety - Low] Does storing Vec<Scalar> in error variants create any memory safety concerns if Scalar types contain non-trivial Drop implementations or reference counted data that could cause use-after-free in complex error handling scenarios?",
  "[File: src/errors.rs] [All Enums] [Error Equality Semantics - Low] For error variants containing floating-point or cryptographic types (Scalar), does PartialEq comparison use appropriate equality semantics (constant-time comparison for secrets, numerical tolerance for floats), or could naive comparison introduce security issues?",
  "[File: src/errors.rs] [DkgError::MissingPublicShares] [Weighted Threshold Confusion - Critical] In the weighted signing model where threshold is counted in key IDs not party IDs, if MissingPublicShares tracks party IDs (u32) but doesn't indicate how many key IDs each missing party controls, can the protocol incorrectly calculate whether enough polynomial shares remain to reconstruct the group key?",
  "[File: src/errors.rs] [DkgError::BadPrivateShares] [Encrypted Share Failure Classification - High] When private shares fail verification after decryption, does BadPrivateShares correctly identify whether the failure occurred during decryption (EncryptionError) versus verification against commitments (commitment mismatch), or could encryption attacks be misclassified as validation failures?",
  "[File: src/errors.rs] [AggregatorError::BadNonceLen] [Nonce Commitment Binding - Critical] If the expected nonce length is derived from the number of participating signers but BadNonceLen compares against a different value (e.g., total possible signers), can an attacker exploit this mismatch to provide nonces that are too short or too long, bypassing binding value validation?",
  "[File: src/errors.rs] [AggregatorError::BadPartySigs] [Lagrange Coefficient Attack - Critical] In weighted signing where Lagrange interpolation uses key IDs rather than party IDs, if BadPartySigs reports party-level failures but doesn't indicate which specific key IDs within a party's set produced invalid shares, can validation incorrectly compute Lagrange coefficients using partial key ID sets?",
  "[File: src/errors.rs] [DkgError::Point] [Schnorr Proof Failure Context - High] When point operations fail during Schnorr ID proof verification in DKG, does the Point error variant preserve enough context to determine whether the failure was in proof generation (malicious prover) versus proof verification (implementation bug), or is this context lost?",
  "[File: src/errors.rs] [EncryptionError::EllipticCurveError] [DH Public Key Validation - Critical] When Diffie-Hellman key exchange fails for private share encryption due to EllipticCurveError, does this indicate that the sender's or receiver's ephemeral DH public key was not validated as being on the correct curve before use, potentially allowing invalid curve attacks?",
  "[File: src/errors.rs] [AggregatorError::BadGroupSig] [Taproot Tweak Inconsistency - Critical] When using taproot-tweaked keys, if BadGroupSig occurs after successful individual share validation, could this indicate that signature shares used the base group key while verification used the tweaked key, or vice versa, allowing signature forgery?",
  "[File: src/errors.rs] [DkgError::TryFromInt] [Key ID Range Overflow - High] If key IDs are derived by multiplying party ID by keys_per_party and this calculation overflows during TryFrom conversion, does TryFromInt error prevent use of wrapped-around key IDs that could collide with other parties' key ID ranges?",
  "[File: src/errors.rs] [AggregatorError::BadPolyCommitments] [Commitment Degree Mismatch - High] Does BadPolyCommitments(Vec<Scalar>) indicate when polynomial commitments have the wrong degree (too few or too many terms), or does it only flag commitments that fail point validation, potentially allowing degree-mismatched polynomials to participate in signing?",
  "[File: src/errors.rs] [DkgError::MissingPrivateShares] [Selective Share Distribution Attack - High] Can a malicious dealer exploit MissingPrivateShares by deliberately sending private shares to only a subset of parties (e.g., colluding parties), then claiming network issues to avoid detection while controlling which parties can complete DKG?",
  "[File: src/errors.rs] [EncryptionError::AesGcm] [Nonce Reuse Detection - Critical] Does AesGcm error variant trigger when the same AES-GCM nonce is reused for multiple encryptions (catastrophic for GCM security), or is nonce reuse only detected through different means outside the error type system?",
  "[File: src/errors.rs] [AggregatorError::BadPartyKeys] [Rogue Key Attack Detection - Critical] When party keys fail validation and BadPartyKeys is returned, does this error specifically identify rogue key attacks where a party's public key was constructed to cancel out other parties' keys, or are rogue keys indistinguishable from other key validation failures?",
  "[File: src/errors.rs] [DkgError::BadPublicShares] [Polynomial Constant Manipulation - Critical] If public share validation fails and BadPublicShares is returned, does this prevent attacks where the polynomial constant term (which becomes part of the group key) is manipulated by the dealer to create a backdoored group key?",
  "[File: src/errors.rs] [AggregatorError::TryFromInt] [Signature Share Scalar Overflow - High] During signature share aggregation, if scalar values derived from signature shares cause integer overflow during TryFrom conversions, does TryFromInt error prevent these malformed shares from being included in the aggregate signature computation?",
  "[File: src/errors.rs] [EncryptionError::MissingData] [Partial Share Leakage - Medium] When MissingData error is returned after partial decryption of a private share, does the error handling ensure that any partially decrypted data is securely zeroed from memory, or could partial plaintexts leak through error propagation paths?"
]